steven87090799/InkTime/esp32/ink-display-7C-photo/ink-display-7C-photo.ino
static bool backendTransportAllowed(const String &base) {
  if (base.startsWith("https://")) return true;
#if INKTIME_ALLOW_INSECURE_DEVICE_HTTP
  return true;
#else
  lastDeviceErrorCode = "DEVICE-HTTP-DISALLOWED";
  lastDeviceErrorMessage = "正式裝置 Backend 必須使用 HTTPS";
  return false;
#endif
}

static void configureHttpClient(HTTPClient &client, uint32_t timeoutMs) {
  client.setConnectTimeout(10000);
  client.setTimeout(timeoutMs);
  client.setFollowRedirects(HTTPC_DISABLE_FOLLOW_REDIRECTS);
}

static String randomPortalSecret() {
  char value[25];
  for (uint8_t i = 0; i < 12; ++i) snprintf(value + i * 2, 3, "%02x", static_cast<unsigned>(esp_random() & 0xff));
  return String(value);
}

static void releaseAllGpioHoldsAtBoot() {
  gpio_deep_sleep_hold_dis();
  for (int gpio = 0; gpio <= 48; ++gpio) {
    gpio_num_t gn = (gpio_num_t)gpio;
    if (!GPIO_IS_VALID_GPIO(gn)) continue;
    gpio_hold_dis(gn);
    if (rtc_gpio_is_valid_gpio(gn)) rtc_gpio_hold_dis(gn);
  }
}

static void clearConfigNVS() {
#if DEBUG_LOG
  DBG_PRINTLN("[NVS] clearConfigNVS()");
#endif
  prefs.begin("dashcfg", false);
  prefs.clear();
  prefs.end();
}

static bool isFactoryResetRequestedAtBoot() {
  if (kBoardConfig.buttons.factoryReset == inktime::kNoPin) return false;
  pinMode(
    kBoardConfig.buttons.factoryReset,
    kBoardConfig.buttons.factoryResetActiveLow ? INPUT_PULLUP : INPUT_PULLDOWN
  );
  delay(FACTORY_RESET_SAMPLE_DELAY_MS);
  const int activeLevel = kBoardConfig.buttons.factoryResetActiveLow ? LOW : HIGH;
  return digitalRead(kBoardConfig.buttons.factoryReset) == activeLevel;
}

static void saveLastTimeEpoch(time_t epoch) {
  prefs.begin("dashcfg", false);
  prefs.putULong("last_epoch", (uint32_t)epoch);
  prefs.end();
#if DEBUG_LOG
  DBG_PRINT("[TIME] save last_epoch="); DBG_PRINTLN((uint32_t)epoch);
#endif
}

static bool loadLastTimeEpoch(time_t &epochOut) {
  prefs.begin("dashcfg", true);
  uint32_t v = prefs.getULong("last_epoch", 0);
  prefs.end();
  if (v == 0) return false;
  epochOut = (time_t)v;
  return true;
}

#if INKTIME_PHOTOPAINTER_ENABLED
static bool loadLastPhotoIndex(size_t fileCount, size_t &indexOut) {
  if (fileCount == 0) return false;
  prefs.begin("dashcfg", true);
  const uint32_t value = prefs.getULong("photo_idx", UINT32_MAX);
  prefs.end();
  if (value == UINT32_MAX || value >= fileCount) return false;
  indexOut = static_cast<size_t>(value);
  return true;
}

static void saveLastPhotoIndex(size_t index) {
  prefs.begin("dashcfg", false);
  prefs.putULong("photo_idx", static_cast<uint32_t>(index));
  prefs.end();
}
#endif

static StoredDisplayRecord loadDisplayRecord() {
  prefs.begin("dashcfg", true);
  const uint8_t version = prefs.getUChar("disp_ver", 0);
  StoredDisplayRecord record = {
    prefs.getString("last_sha", ""),
    prefs.getString("last_rel", ""),
    prefs.getString("last_prof", ""),
    prefs.getString("last_board", ""),
    static_cast<int16_t>(prefs.getShort("last_rot", -1)),
    prefs.getBool("last_ok", false),
    false,
  };
  prefs.end();
  record.valid = version == 1U
    && inktime::isSha256HexValue(record.sha256.c_str())
    && record.releaseId.length() > 0U && record.releaseId.length() <= 128U
    && record.renderProfile.length() > 0U && record.renderProfile.length() <= 64U
    && record.boardProfile.length() > 0U && record.boardProfile.length() <= 96U
    && (record.rotation == 0 || record.rotation == 180);
  return record;
}

static void saveDisplayRecord(const Config &cfg, bool succeeded) {
  if (!inktime::isSha256HexValue(currentPayloadSha256.c_str())
      || currentReleaseId.length() == 0U || currentReleaseId.length() > 128U
      || currentRenderProfile.length() == 0U || currentRenderProfile.length() > 64U) {
    return;
  }
  prefs.begin("dashcfg", false);
  prefs.putUChar("disp_ver", 1U);
  prefs.putString("last_sha", currentPayloadSha256);
  prefs.putString("last_rel", currentReleaseId);
  prefs.putString("last_prof", currentRenderProfile);
  prefs.putString("last_board", kBoardConfig.name);
  prefs.putShort("last_rot", cfg.rotate180 ? 180 : 0);
  prefs.putBool("last_ok", succeeded);
  prefs.end();
}

static bool shouldSkipCurrentDisplay(const Config &cfg) {
  const StoredDisplayRecord stored = loadDisplayRecord();
#if INKTIME_PHOTOPAINTER_ENABLED
  const bool forcedRefresh = photoPainter.forceNetworkRefresh();
#else
  const bool forcedRefresh = false;
#endif
  const inktime::DisplayRecord record = {
    stored.sha256.c_str(),
    stored.releaseId.c_str(),
    stored.renderProfile.c_str(),
    stored.boardProfile.c_str(),
    stored.rotation,
    stored.succeeded,
    stored.valid,
  };
  const inktime::DisplayCandidate candidate = {
    currentPayloadSha256.c_str(),
    currentReleaseId.c_str(),
    currentRenderProfile.c_str(),
    kBoardConfig.name,
    static_cast<int16_t>(cfg.rotate180 ? 180 : 0),
    currentPayloadShaVerified,
    currentPayloadIntegrityTrusted,
    forcedRefresh,
    false,
    false,
  };
  return inktime::shouldSkipDisplay(record, candidate);
}

static bool validPendingQueueAck(PendingQueueAck &pending) {
  const uint8_t event = static_cast<uint8_t>(pending.event);
  pending.valid = inktime::boundedText(
      pending.queueItemId.c_str(), inktime::kQueueIdentifierMaxBytes)
    && pending.queueVersion >= 0
    && event <= static_cast<uint8_t>(inktime::QueueEvent::DisplayFailed)
    && pending.errorCode.length() <= 64U
    && (!pending.delayedTerminal || (
        (pending.event == inktime::QueueEvent::DisplayCompleted
          || pending.event == inktime::QueueEvent::DisplayFailed)
        && inktime::boundedText(pending.releaseId.c_str(), inktime::kQueueIdentifierMaxBytes)));
  return pending.valid;
}

static String ackJournalKey(char prefix, uint8_t index) {
  return String(prefix) + String(index);
}

static PendingQueueAck readAckJournalEntry(Preferences &journal, uint8_t index) {
  PendingQueueAck pending = {
    journal.getString(ackJournalKey('i', index).c_str(), ""),
    journal.getInt(ackJournalKey('v', index).c_str(), -1),
    static_cast<inktime::QueueEvent>(
      journal.getUChar(ackJournalKey('e', index).c_str(), 255U)),
    journal.getBool(ackJournalKey('s', index).c_str(), false),
    journal.getString(ackJournalKey('r', index).c_str(), ""),
    journal.getBool(ackJournalKey('d', index).c_str(), false),
    journal.getString(ackJournalKey('l', index).c_str(), ""),
    false,
  };
  validPendingQueueAck(pending);
  return pending;
}

static void writeAckJournalEntry(
  Preferences &journal,
  uint8_t index,
  const PendingQueueAck &pending
) {
  journal.putString(ackJournalKey('i', index).c_str(), pending.queueItemId);
  journal.putInt(ackJournalKey('v', index).c_str(), pending.queueVersion);
  journal.putUChar(
    ackJournalKey('e', index).c_str(), static_cast<uint8_t>(pending.event));
  journal.putBool(ackJournalKey('s', index).c_str(), pending.displaySkipped);
  journal.putString(ackJournalKey('r', index).c_str(), pending.errorCode);
  journal.putBool(ackJournalKey('d', index).c_str(), pending.delayedTerminal);
  journal.putString(ackJournalKey('l', index).c_str(), pending.releaseId);
}

static bool samePendingQueueAck(
  const PendingQueueAck &left,
  const PendingQueueAck &right
) {
  return left.queueItemId == right.queueItemId
    && left.queueVersion == right.queueVersion
    && left.event == right.event;
}

static uint8_t ackJournalCount(Preferences &journal) {
  return min(
    journal.getUChar("count", 0U),
    static_cast<uint8_t>(inktime::kMaxAckJournalEntries));
}

static void removeLegacyPendingQueueAck() {
  prefs.begin("dashcfg", false);
  prefs.remove("ack_item");
  prefs.remove("ack_ver");
  prefs.remove("ack_event");
  prefs.remove("ack_skip");
  prefs.remove("ack_error");
  prefs.end();
}

static void persistPendingQueueAck(const PendingQueueAck &pending) {
  if (!pending.valid) return;
  Preferences journal;
  journal.begin("acklog", false);
  uint8_t count = ackJournalCount(journal);
  for (uint8_t index = 0; index < count; ++index) {
    const PendingQueueAck existing = readAckJournalEntry(journal, index);
    if (existing.valid && samePendingQueueAck(existing, pending)) {
      journal.end();
      return;
    }
  }
  uint8_t insertAt = count;
  if (count >= inktime::kMaxAckJournalEntries) {
    for (uint8_t index = 1; index < inktime::kMaxAckJournalEntries; ++index) {
      const PendingQueueAck shifted = readAckJournalEntry(journal, index);
      if (shifted.valid) writeAckJournalEntry(journal, index - 1U, shifted);
    }
    insertAt = inktime::kMaxAckJournalEntries - 1U;
  } else {
    ++count;
  }
  writeAckJournalEntry(journal, insertAt, pending);
  journal.putUChar("count", count);
  journal.end();
}

static void removePendingQueueAck(const PendingQueueAck &pending) {
  Preferences journal;
  journal.begin("acklog", false);
  const uint8_t count = ackJournalCount(journal);
  uint8_t found = count;
  for (uint8_t index = 0; index < count; ++index) {
    const PendingQueueAck existing = readAckJournalEntry(journal, index);
    if (existing.valid && samePendingQueueAck(existing, pending)) {
      found = index;
      break;
    }
  }
  if (found < count) {
    for (uint8_t index = found + 1U; index < count; ++index) {
      const PendingQueueAck shifted = readAckJournalEntry(journal, index);
      if (shifted.valid) writeAckJournalEntry(journal, index - 1U, shifted);
    }
    const uint8_t last = count - 1U;
    journal.remove(ackJournalKey('i', last).c_str());
    journal.remove(ackJournalKey('v', last).c_str());
    journal.remove(ackJournalKey('e', last).c_str());
    journal.remove(ackJournalKey('s', last).c_str());
    journal.remove(ackJournalKey('r', last).c_str());
    journal.remove(ackJournalKey('d', last).c_str());
    journal.remove(ackJournalKey('l', last).c_str());
    journal.putUChar("count", last);
  }
  journal.end();
}

static PendingQueueAck loadPendingQueueAck() {
  Preferences journal;
  journal.begin("acklog", true);
  const uint8_t count = ackJournalCount(journal);
  for (uint8_t index = 0; index < count; ++index) {
    PendingQueueAck pending = readAckJournalEntry(journal, index);
    if (pending.valid) {
      journal.end();
      return pending;
    }
  }
  journal.end();

  // Migrate the pre-journal single pending record without losing an event
  // after an upgrade from the previous firmware.
  prefs.begin("dashcfg", true);
  PendingQueueAck legacy = {
    prefs.getString("ack_item", ""),
    prefs.getInt("ack_ver", -1),
    static_cast<inktime::QueueEvent>(prefs.getUChar("ack_event", 255U)),
    prefs.getBool("ack_skip", false),
    prefs.getString("ack_error", ""),
    false,
    "",
    false,
  };
  prefs.end();
  if (validPendingQueueAck(legacy)) {
    persistPendingQueueAck(legacy);
    removeLegacyPendingQueueAck();
    return legacy;
  }
  return legacy;
}

static void clearPendingQueueAck() {
  const PendingQueueAck pending = loadPendingQueueAck();
  if (pending.valid) removePendingQueueAck(pending);
}

static uint32_t minutesToNextRefreshFromLastEpoch(const Config &cfg) {
  time_t lastEpoch;
  if (!loadLastTimeEpoch(lastEpoch)) {
    return 1440;
  }

