steven87090799/InkTime/esp32/ink-display-7C-photo/ink-display-7C-photo.ino
  const bool indexed4 = selectedPixelFormat == "indexed4";
  const size_t packedSize = static_cast<size_t>(FB_WIDTH) * FB_HEIGHT / (indexed4 ? 2U : 4U);
  if (selectedSize != static_cast<int64_t>(packedSize)) {
    lastDeviceErrorCode = "DEVICE-QUEUE-SIZE";
    lastDeviceErrorMessage = "Queue Payload size 與 pixel format 不一致";
    return QueueDownloadResult::Failed;
  }

  uint8_t* packed = nullptr;
#if INKTIME_PHOTOPAINTER_ENABLED
  packed = photoPainter.allocateWireBuffer(packedSize);
#else
  packed = static_cast<uint8_t*>(heap_caps_malloc(packedSize, MALLOC_CAP_8BIT | MALLOC_CAP_SPIRAM));
  if (!packed) packed = static_cast<uint8_t*>(heap_caps_malloc(packedSize, MALLOC_CAP_8BIT));
#endif
  if (!packed) {
    lastDeviceErrorCode = "DEVICE-MEMORY";
    lastDeviceErrorMessage = "無法配置 Queue 下載緩衝區";
    return QueueDownloadResult::Failed;
  }
  if (!sendQueueEvent(cfg, inktime::QueueEvent::DownloadStarted)) {
    heap_caps_free(packed);
    return QueueDownloadResult::Failed;
  }

  HTTPClient fileHttp;
  configureHttpClient(fileHttp, 60000);
  const char* fileHeaders[] = {"Content-Type"};
  fileHttp.collectHeaders(fileHeaders, 1);
  if (!fileHttp.begin(base + selectedDownloadUrl)) {
    heap_caps_free(packed);
    lastDeviceErrorCode = "DEVICE-QUEUE-FILE-URL";
    lastDeviceErrorMessage = "Queue download URL 無法初始化";
    return QueueDownloadResult::Failed;
  }
  fileHttp.addHeader("Authorization", "Bearer " + cfg.device_token);
  const int fileStatus = fileHttp.GET();
  const String fileContentType = fileHttp.header("Content-Type");
  if (fileStatus != HTTP_CODE_OK || fileHttp.getSize() != static_cast<int>(packedSize)
      || !fileContentType.startsWith("application/octet-stream")) {
    fileHttp.end();
    heap_caps_free(packed);
    lastDeviceErrorCode = "DEVICE-QUEUE-DOWNLOAD";
    lastDeviceErrorMessage = "Queue download HTTP／Content-Type／長度不合法";
    return QueueDownloadResult::Failed;
  }
  WiFiClient* stream = fileHttp.getStreamPtr();
  size_t total = 0U;
  const uint32_t started = millis();
  while (total < packedSize && millis() - started < 60000U) {
    const size_t available = stream->available();
    if (available == 0U) {
      if (!fileHttp.connected()) break;
      delay(1);
      continue;
    }
    const size_t count = min(available, packedSize - total);
    const int received = stream->read(packed + total, count);
    if (received > 0) total += static_cast<size_t>(received);
  }
  fileHttp.end();
  if (total != packedSize) {
    heap_caps_free(packed);
    lastDeviceErrorCode = "DEVICE-QUEUE-DOWNLOAD";
    lastDeviceErrorMessage = "Queue Payload 未完整下載";
    return QueueDownloadResult::Failed;
  }
  if (!sendQueueEvent(cfg, inktime::QueueEvent::DownloadCompleted)) {
    heap_caps_free(packed);
    return QueueDownloadResult::Failed;
  }

  unsigned char digest[32];
  if (calculateSha256(packed, packedSize, digest) != 0) {
    heap_caps_free(packed);
    lastDeviceErrorCode = "DEVICE-QUEUE-HASH";
    lastDeviceErrorMessage = "Queue Payload SHA-256 計算失敗";
    return QueueDownloadResult::Failed;
  }
  char actualSha[65];
  for (size_t index = 0; index < 32U; ++index) {
    snprintf(actualSha + index * 2U, 3U, "%02x", digest[index]);
  }
  actualSha[64] = '\0';
  if (!selectedSha.equalsIgnoreCase(String(actualSha))) {
    heap_caps_free(packed);
    lastDeviceErrorCode = "DEVICE-QUEUE-HASH";
    lastDeviceErrorMessage = "Queue Payload SHA-256 不一致";
    return QueueDownloadResult::Failed;
  }
  currentPayloadShaVerified = true;
  if (!sendQueueEvent(cfg, inktime::QueueEvent::HashVerified)) {
    heap_caps_free(packed);
    return QueueDownloadResult::Failed;
  }

  if (frameData) heap_caps_free(frameData);
#if INKTIME_PHOTOPAINTER_ENABLED
  const uint32_t sourceHash = inktime::sourceHash32(selectedSha.c_str());
  const inktime::DisplayRotation rotation = cfg.rotate180
    ? inktime::DisplayRotation::Rotate180
    : inktime::DisplayRotation::Rotate0;
  uint8_t* nativeFrame = nullptr;
  if (!photoPainter.loadCachedFrame(sourceHash, rotation, &nativeFrame, selectedSha.c_str())
      && !photoPainter.convertAndCache(
        packed, packedSize, indexed4, sourceHash, rotation, &nativeFrame, selectedSha.c_str())) {
    heap_caps_free(packed);
    frameData = nullptr;
    lastDeviceErrorCode = photoPainter.lastError();
    lastDeviceErrorMessage = "PhotoPainter Queue framebuffer 轉換失敗";
    return QueueDownloadResult::Failed;
  }
  heap_caps_free(packed);
  frameData = nativeFrame;
  frameDataSize = inktime::kPhotoPainterFrameBytes;
  frameIndexed4 = true;
  frameNativePalette = true;
  if (enhancedOffline && !photoPainter.writeFormalFrame(
        selectedSha.c_str(), rotation, nativeFrame, inktime::kPhotoPainterFrameBytes)) {
    heap_caps_free(nativeFrame);
    frameData = nullptr;
    frameDataSize = 0;
    lastDeviceErrorCode = "DEVICE-OFFLINE-FRAME";
    lastDeviceErrorMessage = "Enhanced Formal Frame 無法原子寫入 SD";
    return QueueDownloadResult::Failed;
  }
#else
  frameData = packed;
  frameDataSize = packedSize;
  frameIndexed4 = indexed4;
  frameNativePalette = false;
#endif
  currentPayloadIntegrityTrusted = true;
  currentDisplaySkipped = shouldSkipCurrentDisplay(cfg);
  return QueueDownloadResult::Used;
}

#if INKTIME_PHOTOPAINTER_ENABLED
static bool offlinePrefetchWake(const Config &cfg, time_t nowEpoch) {
  if (cfg.delivery_mode != "inktime_offline_schedule"
      || cfg.schedule_count == 0 || cfg.prefetch_lead_minutes == 0 || nowEpoch <= 0) {
    return false;
  }
  struct tm localNow = {};
  localtime_r(&nowEpoch, &localNow);
  time_t nextDisplay = 0;
  for (int dayOffset = 0; dayOffset <= 1; ++dayOffset) {
    for (uint8_t index = 0; index < cfg.schedule_count; ++index) {
      struct tm candidate = localNow;
      candidate.tm_sec = 0;
      candidate.tm_min = cfg.schedule_slots[index].minute;
      candidate.tm_hour = cfg.schedule_slots[index].hour;
      candidate.tm_mday += dayOffset;
      const time_t candidateEpoch = mktime(&candidate);
      if (candidateEpoch > nowEpoch
          && (nextDisplay == 0 || candidateEpoch < nextDisplay)) {
        nextDisplay = candidateEpoch;
      }
    }
  }
  if (nextDisplay <= nowEpoch) return false;
  const time_t lead = static_cast<time_t>(cfg.prefetch_lead_minutes) * 60;
  return nowEpoch >= nextDisplay - lead && nowEpoch < nextDisplay;
}
#endif

#if INKTIME_PHOTOPAINTER_ENABLED
static bool loadOfflineScheduledLocalFrame(const Config &cfg, time_t nowEpoch);
#endif

bool downloadDailyPhotoBin(Config &cfg) {
  currentPrefetchOnly = false;
  if (!resumePendingQueueAck(cfg)) return false;
#if INKTIME_PHOTOPAINTER_ENABLED
  const bool timerRequestedNetwork = enhancedNetworkWakeRequested;
  enhancedNetworkWakeRequested = false;
  if (cfg.delivery_mode == "inktime_offline_schedule"
      && (timerRequestedNetwork || offlinePrefetchWake(cfg, time(nullptr)))) {
    const bool displayAtThisWake = cfg.prefetch_lead_minutes == 0U;
    currentPrefetchOnly = !displayAtThisWake;
    const bool prefetched = downloadOfflineScheduleAndFrames(cfg);
    if (prefetched && displayAtThisWake) {
      currentPrefetchOnly = false;
      return loadOfflineScheduledLocalFrame(cfg, time(nullptr));
    }
    return prefetched;
  }
#endif
  const QueueDownloadResult queueResult = downloadQueuePhotoBin(cfg);
  if (queueResult == QueueDownloadResult::Used) return true;
  if (queueResult == QueueDownloadResult::Failed) {
    if (currentFromQueue && !loadPendingQueueAck().valid) {
      sendQueueEvent(cfg, inktime::QueueEvent::DisplayFailed, false, lastDeviceErrorCode);
    }
    return false;
  }
  const bool latest = downloadLatestPhotoBin(cfg);
  if (latest) currentDisplaySkipped = shouldSkipCurrentDisplay(cfg);
  return latest;
}

