steven87090799/InkTime/esp32/ink-display-7C-photo/ink-display-7C-photo.ino
  int curMinOfDay = now.tm_hour * 60 + now.tm_min;
  int targetMin   = (int)cfg.refresh_hour * 60 + (int)cfg.refresh_minute;
  int delta;

  if (curMinOfDay < targetMin) delta = targetMin - curMinOfDay;
  else                         delta = 24 * 60 - (curMinOfDay - targetMin);

  if (delta < 1) delta = 24 * 60;

#if DEBUG_LOG
  DBG_PRINT("[SLEEP] nowMin="); DBG_PRINT(curMinOfDay);
  DBG_PRINT(" targetMin="); DBG_PRINT(targetMin);
  DBG_PRINT(" delta="); DBG_PRINTLN(delta);
#endif

  goDeepSleepMinutes((uint32_t)delta);
}

#if INKTIME_PHOTOPAINTER_ENABLED
static bool parseOfflineLocalDate(const String &value, struct tm &output) {
  if (value.length() != 10 || value[4] != '-' || value[7] != '-') return false;
  const int year = value.substring(0, 4).toInt();
  const int month = value.substring(5, 7).toInt();
  const int day = value.substring(8, 10).toInt();
  if (year < 2020 || year > 2200 || month < 1 || month > 12 || day < 1 || day > 31) {
    return false;
  }
  output = {};
  output.tm_year = year - 1900;
  output.tm_mon = month - 1;
  output.tm_mday = day;
  output.tm_isdst = -1;
  return true;
}

static bool loadOfflineScheduledLocalFrame(const Config &cfg, time_t nowEpoch) {
  // Enhanced local mode is deliberately cache-only.  It never calls Wi-Fi,
  // NTP, Manifest, or status endpoints; a missing formal frame is a safe
  // no-refresh result instead of a network fallback.
  if (nowEpoch <= 0) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-FRAME";
    lastDeviceErrorMessage = "離線排程沒有可驗證的 RTC 時間";
    return false;
  }
  String activeJson;
  if (!photoPainter.readActiveSchedule(activeJson)) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE";
    lastDeviceErrorMessage = "離線排程 active schedule 不存在或無法讀取";
    return false;
  }
  JsonDocument active;
  const DeserializationError jsonError = deserializeJson(active, activeJson);
  const JsonVariantConst rawSlots = active["slots"];
  String targetDate = active["target_local_date"] | "";
  if (targetDate.length() == 0U) targetDate = active["target_date"] | "";
  const String activeTargetDate = active["target_local_date"] | "";
  const String activeLegacyDate = active["target_date"] | "";
  const String activeDeliveryMode = active["delivery_mode"] | "";
  const String activeTimezone = active["timezone"] | "";
  const String activeScheduleId = active["schedule_id"] | "";
  const String activePanelProfile = active["panel_profile"] | "";
  const String activeButtonWakeAction = active["button_wake_action"] | "";
  const JsonVariantConst activeSchema = active["schema_version"];
  const JsonVariantConst activeConfigVersion = active["config_version"];
  const JsonVariantConst activeRotation = active["rotation"];
  const JsonVariantConst activeScheduleVersion = active["offline_schedule_version"];
  if (jsonError || active.overflowed() || !rawSlots.is<JsonArrayConst>()
      || targetDate.length() != 10 || activeTargetDate.length() == 0U
      || (activeLegacyDate.length() > 0U && activeLegacyDate != activeTargetDate)
      || !activeSchema.is<int32_t>() || activeSchema.is<bool>()
      || activeSchema.as<int32_t>() != inktime::kOfflineScheduleSchemaVersion
      || activeDeliveryMode != "inktime_offline_schedule"
      || activeTimezone.length() == 0U || activeTimezone.length() > 64U
      || activeScheduleId.length() == 0U
      || !activeConfigVersion.is<uint32_t>() || activeConfigVersion.is<bool>()
      || !activeRotation.is<int32_t>() || activeRotation.is<bool>()
      || !activeScheduleVersion.is<int32_t>() || activeScheduleVersion.is<bool>()
      || activeScheduleVersion.as<int32_t>() < 0) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE";
    lastDeviceErrorMessage = "離線排程 active schedule schema 不合法";
    return false;
  }
  struct tm targetLocal = {};
  if (!parseOfflineLocalDate(targetDate, targetLocal)) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE";
    lastDeviceErrorMessage = "離線排程 target date 不合法";
    return false;
  }
  struct tm nowLocal = {};
  localtime_r(&nowEpoch, &nowLocal);
  if (nowLocal.tm_year != targetLocal.tm_year
      || nowLocal.tm_mon != targetLocal.tm_mon
      || nowLocal.tm_mday != targetLocal.tm_mday) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE";
    lastDeviceErrorMessage = "離線排程不是目前本地日期";
    return false;
  }
  const JsonArrayConst slots = rawSlots.as<JsonArrayConst>();
  JsonArrayConst rawTimes = active["schedule_times"].as<JsonArrayConst>();
  if (rawTimes.isNull()) rawTimes = active["schedule"].as<JsonArrayConst>();
  if (rawTimes.isNull() || rawTimes.size() == 0U
      || rawTimes.size() > inktime::kMaxOfflineSlots || rawTimes.size() != slots.size()) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE";
    lastDeviceErrorMessage = "離線排程 active schedule_times 不合法";
    return false;
  }
  inktime::OfflineSlot activeScheduleSlots[inktime::kMaxOfflineSlots] = {};
  for (size_t index = 0; index < rawTimes.size(); ++index) {
    if (!parseOfflineClock(rawTimes[index] | "", activeScheduleSlots[index])) {
      lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE";
      lastDeviceErrorMessage = "離線排程 active 時刻格式不合法";
      return false;
    }
  }
  if (!inktime::validateOfflineSlots(activeScheduleSlots, static_cast<uint8_t>(rawTimes.size()))
      || rawTimes.size() != cfg.schedule_count
      || !inktime::validateOfflineSlots(cfg.schedule_slots, cfg.schedule_count)) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE";
    lastDeviceErrorMessage = "離線排程 active 時刻與本機設定不一致";
    return false;
  }
  for (uint8_t index = 0; index < cfg.schedule_count; ++index) {
    if (activeScheduleSlots[index].hour != cfg.schedule_slots[index].hour
        || activeScheduleSlots[index].minute != cfg.schedule_slots[index].minute) {
      lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE";
      lastDeviceErrorMessage = "離線排程 active 時刻與本機設定不一致";
      return false;
    }
  }
  char localDate[11] = {0};
  snprintf(
    localDate,
    sizeof(localDate),
    "%04d-%02d-%02d",
    nowLocal.tm_year + 1900,
    nowLocal.tm_mon + 1,
    nowLocal.tm_mday
  );
  inktime::OfflineScheduleContract contract = {
    activeSchema.as<int32_t>(),
    activeDeliveryMode.c_str(),
    activeTargetDate.c_str(),
    localDate,
    activeTimezone.c_str(),
    activeConfigVersion.as<uint32_t>(),
    cfg.config_version,
    activeRotation.as<int32_t>(),
    activePanelProfile.c_str(),
    INKTIME_PANEL_PROFILE,
    activeButtonWakeAction.c_str(),
    static_cast<uint8_t>(slots.size()),
    static_cast<uint8_t>(rawTimes.size()),
    true,
    true,
  };
  if (activeConfigVersion.as<uint32_t>() != cfg.config_version
      || !inktime::validOfflineScheduleContract(contract)
      || cfg.delivery_mode != "inktime_offline_schedule"
      || cfg.rotate180 != (activeRotation.as<int32_t>() == 180)) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE";
    lastDeviceErrorMessage = "離線排程 active 快照與本機設定不一致";
    return false;
  }
  for (size_t index = 0; index < slots.size(); ++index) {
    const JsonVariantConst rawSlot = slots[index];
    if (!rawSlot.is<JsonObjectConst>()) {
      lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE";
      lastDeviceErrorMessage = "離線排程 active Slot 身分不合法";
      return false;
    }
    const JsonObjectConst slot = rawSlot.as<JsonObjectConst>();
    const JsonVariantConst rawIndex = slot["slot_index"];
    const JsonVariantConst rawVersion = slot["queue_version"];
    const String slotScheduleId = slot["offline_schedule_id"] | "";
    const String slotItemId = slot["queue_item_id"] | "";
    const String slotReleaseId = slot["release_id"] | "";
    const String slotSha = slot["sha256"] | "";
    const String slotProfile = slot["render_profile"] | "";
    if (!rawIndex.is<int32_t>() || rawIndex.is<bool>()
        || rawIndex.as<int32_t>() != static_cast<int32_t>(index)
        || !rawVersion.is<int32_t>() || rawVersion.is<bool>() || rawVersion.as<int32_t>() < 0
        || slotScheduleId != activeScheduleId
        || !inktime::boundedText(slotItemId.c_str(), inktime::kQueueIdentifierMaxBytes)
        || !inktime::boundedText(slotReleaseId.c_str(), inktime::kQueueIdentifierMaxBytes)
        || !inktime::isSha256Hex(slotSha.c_str())
        || (slotProfile != "safe_4c" && slotProfile != String(INKTIME_PANEL_PROFILE))) {
      lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE";
      lastDeviceErrorMessage = "離線排程 active Slot 身分或完整性不合法";
      return false;
    }
  }
  int selectedIndex = -1;
  time_t selectedEpoch = 0;
  String selectedSha;
  String selectedRelease;
  String selectedProfile;
  String selectedQueueItemId;
  int32_t selectedQueueVersion = -1;
  for (size_t index = 0; index < slots.size(); ++index) {
    const JsonVariantConst rawSlot = slots[index];
    if (!rawSlot.is<JsonObjectConst>()) continue;
    const JsonObjectConst slot = rawSlot.as<JsonObjectConst>();
    const int slotIndex = slot["slot_index"] | -1;
    if (slotIndex < 0 || slotIndex >= static_cast<int>(rawTimes.size())) continue;
    struct tm candidate = targetLocal;
    candidate.tm_hour = activeScheduleSlots[slotIndex].hour;
    candidate.tm_min = activeScheduleSlots[slotIndex].minute;
    candidate.tm_sec = 0;
    const time_t candidateEpoch = mktime(&candidate);
    const String sha = slot["sha256"] | "";
    if (candidateEpoch <= nowEpoch && candidateEpoch >= selectedEpoch
        && inktime::isSha256Hex(sha.c_str())) {
      selectedIndex = slotIndex;
      selectedEpoch = candidateEpoch;
      selectedSha = sha;
      selectedRelease = slot["release_id"] | "";
      selectedProfile = slot["render_profile"] | "";
      selectedQueueItemId = slot["queue_item_id"] | "";
      selectedQueueVersion = slot["queue_version"] | -1;
    }
  }
  if (selectedIndex < 0 || !inktime::isSha256Hex(selectedSha.c_str())) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-FRAME";
    lastDeviceErrorMessage = "目前離線排程 Slot 沒有可驗證的正式 Frame";
    return false;
  }
  const inktime::DisplayRotation rotation = activeRotation.as<int32_t>() == 180
    ? inktime::DisplayRotation::Rotate180
    : inktime::DisplayRotation::Rotate0;
  currentReleaseId = selectedRelease;
  currentRenderProfile = selectedProfile;
  currentQueueItemId = selectedQueueItemId;
  currentQueueVersion = selectedQueueVersion;
  currentFromQueue = inktime::boundedText(
      currentQueueItemId.c_str(), inktime::kQueueIdentifierMaxBytes)
    && currentQueueVersion >= 0;
  uint8_t* localFrame = nullptr;
  if (!photoPainter.loadFormalFrame(selectedSha.c_str(), rotation, &localFrame)) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-FRAME";
    lastDeviceErrorMessage = "離線排程正式 Frame 不存在或完整性驗證失敗";
    return false;
  }
  if (frameData) heap_caps_free(frameData);
  frameData = localFrame;
  frameDataSize = inktime::kPhotoPainterFrameBytes;
  frameIndexed4 = true;
  frameNativePalette = true;
  currentPayloadSha256 = selectedSha;
  currentPayloadShaVerified = true;
  currentPayloadIntegrityTrusted = true;
  currentDisplaySkipped = shouldSkipCurrentDisplay(cfg);
  return true;
}

static void runOfflineLocalCycle() {
  time_t rtcEpoch = 0;
  struct tm offlineTime = {};
  const bool hasOfflineTime = photoPainter.readRtc(rtcEpoch);
  if (hasOfflineTime) {
    struct timeval value = {rtcEpoch, 0};
    settimeofday(&value, nullptr);
    applyFixedTimezoneWithoutNtp(g_cfg.tz_offset_minutes);
    localtime_r(&rtcEpoch, &offlineTime);
  }
  const bool ok = loadOfflineScheduledLocalFrame(g_cfg, hasOfflineTime ? rtcEpoch : 0);
  bool displayUpdated = false;
  if (ok) {
    if (currentDisplaySkipped) {
      displayUpdated = true;
    } else {
      initDisplay(g_cfg);
      displayUpdated = drawFromFrameData(g_cfg);
    }
    if (displayUpdated) saveDisplayRecord(g_cfg, true);
    if (currentFromQueue) {
      if (displayUpdated) {
        sendQueueEvent(
          g_cfg,
          inktime::QueueEvent::DisplayCompleted,
          currentDisplaySkipped,
          String(""),
          true
        );
      } else {
        sendQueueEvent(
          g_cfg,
          inktime::QueueEvent::DisplayFailed,
          false,
          photoPainter.lastError(),
          true
        );
      }
    }
  } else if (currentFromQueue) {
    // A missing/corrupt formal frame still gets a durable terminal outcome;
    // the queue reservation must not be silently left without a display ACK.
    sendQueueEvent(
      g_cfg,
      inktime::QueueEvent::DisplayFailed,
      false,
      photoPainter.lastError(),
      true
    );
  }
  if (!displayUpdated && ok) {
    lastDeviceErrorCode = photoPainter.lastError();
    lastDeviceErrorMessage = "離線排程電子紙刷新失敗或逾時";
    saveDisplayRecord(g_cfg, false);
  }
  // There is intentionally no reportDeviceStatus() here: that endpoint is a
  // network call and enhanced local mode must remain fully offline.
  sleepUntilNextSchedule(g_cfg, hasOfflineTime, offlineTime);
}
#endif

// =======================
//  setup / loop
// =======================
void setup() {
  releaseAllGpioHoldsAtBoot();

  setCpuFrequencyMhz(80);
  if (kBoardConfig.statusLed != inktime::kNoPin) {
    pinMode(kBoardConfig.statusLed, OUTPUT);
    digitalWrite(kBoardConfig.statusLed, LOW);
  }

  DBG_BEGIN();
  delay(200);

#if DEBUG_LOG
  DBG_PRINTLN();
  DBG_PRINTLN("===== ESP32-S3 InkTime Daily Photo boot =====");
#if INKTIME_ALLOW_INSECURE_DEVICE_HTTP
  DBG_PRINTLN("[SECURITY] trusted-LAN HTTP build：僅限可信任 LAN／IoT VLAN，沒有 TLS");
#endif
#endif

