steven87090799/InkTime/esp32/ink-display-7C-photo/ink-display-7C-photo.ino
  if (isFactoryResetRequestedAtBoot()) {
#if DEBUG_LOG
  DBG_PRINT("[BOOT] factory reset GPIO=");
  DBG_PRINTLN((int)kBoardConfig.buttons.factoryReset);
#endif
  clearConfigNVS();

  WiFi.disconnect(true, true);
  WiFi.mode(WIFI_OFF);
  esp_wifi_stop();
  delay(200);
}

  randomSeed(esp_random());

#if INKTIME_PHOTOPAINTER_ENABLED
  if (!photoPainter.begin()) {
    lastDeviceErrorCode = photoPainter.lastError();
    lastDeviceErrorMessage = "PhotoPainter Flash／OPI PSRAM 不存在或容量不足";
  }
#endif

  loadConfig(g_cfg);

  if (!g_cfg.valid) {
#if DEBUG_LOG
    DBG_PRINTLN("[BOOT] no valid config -> AP portal");
#endif
    startConfigPortal();
  }

#if INKTIME_PHOTOPAINTER_ENABLED
  const esp_sleep_wakeup_cause_t wakeCause = esp_sleep_get_wakeup_cause();
  const bool timerWake = wakeCause == ESP_SLEEP_WAKEUP_TIMER;
  if (g_cfg.delivery_mode == "inktime_offline_schedule" && timerWake
      && !photoPainter.forceNetworkRefresh()) {
    time_t rtcEpoch = 0;
    if (!photoPainter.readRtc(rtcEpoch)) {
      runOfflineLocalCycle();
      return;
    }
    applyFixedTimezoneWithoutNtp(g_cfg.tz_offset_minutes);
    struct timeval value = {rtcEpoch, 0};
    settimeofday(&value, nullptr);
    const bool networkWake = g_cfg.prefetch_lead_minutes == 0U
      || offlinePrefetchWake(g_cfg, rtcEpoch);
    if (!networkWake) {
      runOfflineLocalCycle();
      return;
    }
    enhancedNetworkWakeRequested = true;
  }
#endif

#if DEBUG_LOG
  DBG_PRINTLN("[BOOT] have config -> connect WiFi");
#endif
  if (!connectWiFi(g_cfg)) {
#if DEBUG_LOG
    DBG_PRINTLN("[BOOT] connect failed");
#endif
#if INKTIME_PHOTOPAINTER_ENABLED
    // Known battery power must not remain in a network retry/configuration loop.
    // USB or an unidentified PMIC keeps the bounded AP diagnostics path available.
    if (photoPainter.powerSourceKnown() && !photoPainter.usbConnected()) {
      applyFixedTimezoneWithoutNtp(g_cfg.tz_offset_minutes);
      time_t rtcEpoch = 0;
      struct tm offlineTime = {};
      bool hasOfflineTime = photoPainter.readRtc(rtcEpoch);
      if (hasOfflineTime) {
        struct timeval value = {rtcEpoch, 0};
        settimeofday(&value, nullptr);
        localtime_r(&rtcEpoch, &offlineTime);
      }
      lastDeviceErrorCode = "DEVICE-WIFI-TIMEOUT";
      lastDeviceErrorMessage = "電池模式 Wi-Fi 逾時，已停止重試";
      sleepUntilNextSchedule(g_cfg, hasOfflineTime, offlineTime);
    }
#endif
    DBG_PRINTLN("[BOOT] enter bounded AP portal");
    startConfigPortal();
  }

  struct tm timeinfo;
  bool hasTime = syncTime(g_cfg, timeinfo);

  bool ok = downloadDailyPhotoBin(g_cfg);
  if (serverConfigChanged) hasTime = syncTime(g_cfg, timeinfo);
  bool displayUpdated = false;
  if (ok) {
    if (currentPrefetchOnly) {
      displayUpdated = false;
    } else {
    bool mayDisplay = true;
    if (currentDisplaySkipped) {
      saveDisplayRecord(g_cfg, true);
      if (currentFromQueue) {
        mayDisplay = sendQueueEvent(g_cfg, inktime::QueueEvent::DisplayCompleted, true);
      }
    } else if (currentFromQueue) {
      mayDisplay = sendQueueEvent(g_cfg, inktime::QueueEvent::DisplayStarted);
    }
    if (mayDisplay && !currentDisplaySkipped) {
      initDisplay(g_cfg);
      displayUpdated = drawFromFrameData(g_cfg);
    }
    if (displayUpdated) {
      saveDisplayRecord(g_cfg, true);
      if (currentFromQueue) {
        sendQueueEvent(g_cfg, inktime::QueueEvent::DisplayCompleted);
      }
    } else if (!currentDisplaySkipped && mayDisplay) {
#if INKTIME_PHOTOPAINTER_ENABLED
      lastDeviceErrorCode = photoPainter.lastError();
#else
      lastDeviceErrorCode = "DEVICE-DISPLAY";
#endif
      lastDeviceErrorMessage = "電子紙刷新失敗或逾時";
      saveDisplayRecord(g_cfg, false);
      if (currentFromQueue && !loadPendingQueueAck().valid) {
        sendQueueEvent(g_cfg, inktime::QueueEvent::DisplayFailed, false, lastDeviceErrorCode);
      }
    }
    }
  } else {
#if DEBUG_LOG
    DBG_PRINTLN("[BOOT] downloadDailyPhotoBin FAILED");
#endif
  }
  reportDeviceStatus(g_cfg, displayUpdated);

#if INKTIME_PHOTOPAINTER_ENABLED
  if (runUsbServiceMode()) {
    // The prior timestamp may be hours old after a USB service session.
    hasTime = getLocalTime(&timeinfo, 1000);
  }
#endif

  if (!hasTime) {
    struct tm tmp;
    if (syncTime(g_cfg, tmp)) sleepUntilNextSchedule(g_cfg, true, tmp);
    else                      sleepUntilNextSchedule(g_cfg, false, timeinfo);
  } else {
    sleepUntilNextSchedule(g_cfg, true, timeinfo);
  }
}

void loop() {
}
